"""
============================
Author:柠檬班-木森
Time:2020/1/6   20:47
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
需求：打印100白hello python

"""


# 定义一个变量来计数，记录打印了多少遍hello python
i = 0
while i < 100:
    i = i + 1
    print("这是第{}遍打印：hello python".format(i))

# -------------------------------死循环-------------------------：
# 循环条件始终成立的循环称之为死循环
# while True:
#     print("hello python")

# i = 0
# while i < 100:
#     print("这是第{}遍打印：hello python".format(i))


# ---------------------------break-----------------------------
# 如果终止循环（包括死循环）：break(只能用在循环里面)
# break的作用：终止循环，
# 需求  当打印到第50遍的时候，循环结束

# i = 0
# while i < 100:
#     i = i + 1
#     print("这是第{}遍打印：hello python".format(i))
#     if i == 50:
#         break
#     print('-----------end：{}-----------'.format(i))
#
# print("---------循环体之外的代码-------------")


# ---------------------------continue:-----------------------------
# continue:中止当前本轮循环，进行下一轮循环的条件判断（执行到continue之后，会直接回到while后面进行添加判读）

# i = 0
# while i < 100:
#     i = i + 1
#     print("这是第{}遍打印：hello python".format(i))
#     if i == 50:
#         continue
#     print('-----------end：{}-----------'.format(i))
#
# print("---------循环体之外的代码-------------")
