"""
============================
Author:柠檬班-木森
Time:2020/1/8   20:55
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
总结：for 和 while的区别

while:条件循环
是根据条件来决定要不要进行循环。

break的作用：终止循环
continue:中止当前本轮循环，进行下一轮循环的条件判断

while——else:（有时间可以去进行扩展学习，几乎用不到）
# while里面的else会在，while的循环条件不成立的时候执行，如果是break介绍的循环，则不会执行对应的else



for:遍历循环
是根据遍历来进行循环的，遍历多少次，循环多少次
break的作用：终止循环
continue:中止当前本轮循环，进行下一轮循环的条件判断

for——else语句：for循环遍历结束之后会执行else,如果使用break跳出循环，则不会执行


# 注意点：for循环和while都可以嵌套使用，正常的应用嵌套不会超过三层（一般最多就是两层）
# 注意点2：break结束的是套在break身上的那层循环（离break最近的那层）

"""
