"""
============================
Author:柠檬班-木森
Time:2020/1/6   21:20
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
for 循环的使用

语法：
for i in XXX:
    # 循环体


"""

# li = ["张三", "李四", "王五"]
#
# for i in li:
#
#     print(i)

"""
入门小练习：当前有10位同学的成绩，放在一个列表中，请区分成绩的等级
# 要求
# 小于60： 不及格
# 60-79：  及格
# 80-100）：优秀

# """
# li = [78, 32, 55, 77, 88, 90, 54, 24, 67, 39]
#
# for i in li:
#     if i < 60:
#         print("你的成绩是{}，不及格".format(i))
#     elif i < 80:
#         print("你的成绩是{}，及格".format(i))
#     elif i <= 100:
#         print("你的成绩是{}，优秀".format(i))
